In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
url = "https://raw.githubusercontent.com/fivethirtyeight/data/master/airline-safety/airline-safety.csv"
airline_safety = pd.read_csv(url)

In [ ]:
airline_safety.head(5)
airline_safety.tail(5)
airline_safety.shape
airline_safety.describe()
airline_safety.info()

#Select companies and incidents_85_99 with incidents_85_99 is less than 10
airline_safety[(airline_safety["incidents_85_99"] < 10)]

#Group companies by first letter(lower) and take the mean incidents_85_99 and make it a dataframe again
airline_safety.groupby(airline_safety["airline"])["incidents_85_99"].mean().to_frame()

In [6]:
alcohol_consumption = pd.read_csv("/home/lorenzo/Scaricati/world_alcohol.csv")

In [ ]:
alcohol_consumption[~ alcohol_consumption["WHO region"].isin(["Africa", "Europe", "Eastern Mediterranean"])]

In [ ]:
alcohol_consumption[alcohol_consumption["Display Value"].between(0.5,2.5)]

In [53]:
alcohol_consumption.head()

   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98

In [54]:
cond1 = alcohol_consumption["Beverage Types"] == "Wine"
cond2 = alcohol_consumption["Display Value"] > 2
alcohol_consumption[cond1 & cond2]

    Year WHO region      Country Beverage Types  Display Value
57  1989     Europe      Croatia           Wine           5.10
81  1985     Europe  Netherlands           Wine           2.54
96  1985     Europe   Luxembourg           Wine           7.38

In [59]:
alcohol_consumption.loc[0:9, alcohol_consumption.columns[1:4]]

        WHO region                Country Beverage Types
0  Western Pacific               Viet Nam           Wine
1         Americas                Uruguay          Other
2           Africa           Cte d'Ivoire           Wine
3         Americas               Colombia           Beer
4         Americas  Saint Kitts and Nevis           Beer
5         Americas              Guatemala          Other
6           Africa              Mauritius           Wine
7           Africa                 Angola        Spirits
8         Americas    Antigua and Barbuda        Spirits
9           Africa                Nigeria          Other

In [7]:
alcohol_consumption.iloc[1::5]

,Year,WHO region,Country,Beverage Types,Display Value
1,1986,Americas,Uruguay,Other,0.50
6,1987,Africa,Mauritius,Wine,0.13
11,1989,Americas,Guatemala,Beer,0.62
16,1984,Americas,Costa Rica,Wine,0.06
21,1989,Americas,Costa Rica,Spirits,4.51
26,1985,Europe,United Kingdom of Great Britain and Northern I...,Wine,1.36
31,1986,Western Pacific,Micronesia (Federated States of),Wine,0.00
36,1987,Eastern Mediterranean,Egypt,Beer,0.07
41,1986,Europe,Czech Republic,Beer,6.82
46,1987,Americas,Trinidad and Tobago,Spirits,2.26
51,1987,Europe,Finland,Beer,3.88
56,1987,Western Pacific,Viet Nam,Wine,0.00
61,1984,Western Pacific,Papua New Guinea,Spirits,0.08
66,1987,Eastern Mediterranean,Iraq,Wine,0.01
71,1985,Africa,Mali,Other,0.57
76,1985,Africa,Comoros,Beer,0.02
81,1985,Europe,Netherlands,Wine,2.54
86,1986,Americas,Bahamas,Wine,1.83
91,1989,Europe,Bulgaria,Beer,4.43
96,1985,Europe,Luxembourg,Wine,7.38

In [ ]:
import pandas as pd
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data.groupby("school_code")["age"].agg(['mean', 'min', 'max'])
student_data.head(10)
grouped_student_data = student_data.groupby("school_code")
type(grouped_student_data)
print(grouped_student_data.groups)

AttributeError: 'tuple' object has no attribute 'head'

In [20]:
student_data.groupby("school_code")["age"].agg(['mean', 'min', 'max'])

             mean  min  max
school_code
s001         12.5   12   13
s002         13.0   12   14
s003         13.0   13   13
s004         12.0   12   12

In [ ]:
grouped = student_data.groupby(["school_code", "class"])
for (school, class_), group in grouped:
    print(f"School Code: {school}, Class: {class_}")
    print(group)

School Code: s001, Class: V
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1
School Code: s001, Class: VI
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1
School Code: s002, Class: V
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
School Code: s003, Class: VI
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
School Code: s004, Class: VI
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [36]:
student_data.groupby(["school_code", "class"]).describe()

                    age                                               height  \
                  count  mean       std   min   25%   50%   75%   max  count
school_code class
s001        V       1.0  12.0       NaN  12.0  12.0  12.0  12.0  12.0    1.0
            VI      1.0  13.0       NaN  13.0  13.0  13.0  13.0  13.0    1.0
s002        V       2.0  13.0  1.414214  12.0  12.5  13.0  13.5  14.0    2.0
s003        VI      1.0  13.0       NaN  13.0  13.0  13.0  13.0  13.0    1.0
s004        VI      1.0  12.0       NaN  12.0  12.0  12.0  12.0  12.0    1.0

                          ...                weight                        \
                    mean  ...     75%    max  count  mean       std   min
school_code class         ...
s001        V      173.0  ...  173.00  173.0    1.0  35.0       NaN  35.0
            VI     167.0  ...  167.00  167.0    1.0  30.0       NaN  30.0
s002        V      171.5  ...  181.75  192.0    2.0  31.5  0.707107  31.0
s003        VI     186.0  ...  186.00  186.0    1.0  33.0       NaN  33.0
s004        VI     159.0  ...  159.00  159.0    1.0  32.0       NaN  32.0


                     25%   50%    75%   max
school_code class
s001        V      35.00  35.0  35.00  35.0
            VI     30.00  30.0  30.00  30.0
s002        V      31.25  31.5  31.75  32.0
s003        VI     33.00  33.0  33.00  33.0
s004        VI     32.00  32.0  32.00  32.0

[5 rows x 24 columns]